app/Http/Controllers/Game/AnimalController.php

    public function create(AnimalCreateRequest $request)
    {
        $user = $request->user();
        /** @var Farm $farm */
        $farm = $request->user()->farm()->first();
        $animal = Animal::query()->find($request->id, ['id', 'min_size']);

        if ($farm->animals()->where('animals.id', $animal->id)->doesntExist()) {
            $farm->animals()->attach($animal->id, ['size' => $animal->min_size]);
---
select * from `farms` where `farms`.`id` = 1 and `farms`.`id` is not null limit 1
select `id`, `min_size` from `animals` where `animals`.`id` = 2 limit 1
insert into `farm_animal` (`animal_id`, `farm_id`, `size`) values (2, 1, 1)