app/Http/Controllers/Game/MainController.php

    public function __invoke(Request $request): \Inertia\Response
    {
        $user = $request->user();
        $this->updateFarm($user);

        /** @var Collection $animalFarmList */
        $animalFarmList = $user->farm
            ->animals()
            ->withPivot('size as size', 'id')
            ->get();
        $animalList = Animal::query()
            ->select('id', 'avatar')
            ->get()
            ->map(function (Animal $animal) use($animalFarmList) {
                    $farmAnimal = $animalFarmList->where('id', $animal->id);
                if ($farmAnimal->isNotEmpty()) {
                    $animal->setAttribute('selected', true);
                    $animal->setAttribute('size', $farmAnimal->get('size', 1));
                } else {
                    $animal->setAttribute('selected', false);
                }

                return $animal;
            });
---
select * from `farms` where `farms`.`id` = 1 and `farms`.`id` is not null limit 1
select `animals`.*, `farm_animal`.`farm_id` as `pivot_farm_id`, `farm_animal`.`animal_id` as `pivot_animal_id`, `farm_animal`.`size` as `size`, `farm_animal`.`id` as `farm_animal_id_pivot` from `animals` inner join `farm_animal` on `animals`.`id` = `farm_animal`.`animal_id` where `farm_animal`.`farm_id` = 1
select `id`, `avatar` from `animals`

    private function updateFarm(User $user)
    {
        if (is_null($user->getAttribute('farm_id'))) {
            $user->update([
                'farm_id' => $user->farm()->create()->id
            ]);
---
update `users` set `farm_id` = 1, `users`.`updated_at` = '2022-05-27 11:53:51' where `id` = 1