app/Jobs/AnimalLifeCycleJob.php

    public function __construct(Farm|int $farm, Animal|int $animal, User|int $user)
    {
        $this->farm = $farm instanceof Farm ? $farm : Farm::query()->find($farm);
        $this->animal = $animal instanceof Animal ? $animal : Animal::query()->find($animal);
        $this->user = $user instanceof User ? $user : User::query()->find($user);
---
select * from `animals` where `animals`.`id` = 2 limit 1
select * from `users` where `users`.`id` = 1 limit 1

    public function handle(): void
    {
        /** @var FarmAnimal $farmAnimal */
        $farmAnimal = $this->farm
            ->pivotFarmAnimals()
            ->where('farm_animal.animal_id', $this->animal->id)
//            ->select('farm_animal.id', 'farm_animal.size', 'farm_animal.age')
            ->first();
---
select * from `farm_animal` where `farm_animal`.`farm_id` = 1 and `farm_animal`.`farm_id` is not null and `farm_animal`.`animal_id` = 2 limit 1
select `id`, `size`, `age` from `farm_animal` where `farm_animal`.`farm_id` = 1 and `farm_animal`.`farm_id` is not null and `animal_id` = 1 limit 1

    private function nextLvl(FarmAnimal $farmAnimal)
    {
        $size = $farmAnimal->size;
        $farmAnimal->update([
            'size' => min($size + $this->animal->growth_rate, $this->animal->max_size),
            'farm_animal.age' => $farmAnimal->age++,
        ]);
---
update `farm_animal` set `size` = 2, `age` = 1, `farm_animal`.`updated_at` = '2022-05-27 08:05:28' where `id` = 51